[
    {
      "id": 1,
      "name": "Potentially A Blog",
      "image": "https://i.ibb.co/gV20x3B/potentially-a-blog.png",
      "description": "Potentially a Blog: We wanted to create a blogging application where we could use passwords and sign out functionality so user could have a personal blogging account and write blogs with their peers. An application that allows user to write blogs along with other users, update their blogs, delete their blogs, and views all of the blogs as well as interact with other users in the near future. (Something like tumblr, but better).",
      "href": "https://whispering-stream-30896.herokuapp.com/"
    },
    {
      "id": 2,
      "name": "SMRTrvl",
      "image": "https://i.ibb.co/cCtLqGX/smrtrvl.png",
      "description": "SMRTrvl: Travel during covid 19 pandemic poses extra risk Project Description: Goal of the project is to simplify the unknown risk of travel to countries that user is trying to travel to as well as display tickets within the users price range. Will allow users to find plane tickets to countries within their budget. API's Used: SkyScanner, COVID-19 Coronavirus Statistics.",
      "href": "https://lohelani.github.io/smarTRVL/"
    },
    {
      "id": 3,
      "name": "User Directory",
      "image": "https://i.ibb.co/8N08NJF/user-directory.png",
      "description": "User Directory: For this application I used react to create an employee user page from an api provided by randomuser.me. Application allows employer to search for user by name, number, email, and phone number. As employer types, the list will narrow down to the specifs whihc they are searching. Functionality is broken into components. Application uses react bootstrap.",
      "href": "https://lohelani.github.io/User-directory/"
    },
    {
      "id": 4,
      "name": "Workout Tracker",
      "image": "https://i.ibb.co/HpV72Q2/workout-tracker.png",
      "description": "Workout Tracker: For this application I used mongoDB to create a database that would track the users workouts and progress by adding up the totals for the time a user worked out(duration), the distance they may have traveled if doing cardio, and the total number of weight lifted for the past seven workouts. I used router for the routes, mongoose for the schema, and heroku to connect launch the application. User also has the option to view all the toals on the stats page which gives them a visual for their progress.",
      "href": "https://pacific-journey-14962.herokuapp.com/"
    },
    {
      "id": 5,
      "name": "Weather Dashboard",
      "image": "https://i.ibb.co/qpMJsM0/weather-dashboard.png",
      "description": "Weather Dashboard: Provide the user the ability to search for a city. Show the current and future conditions for that city. Present the city name, the date, an icon representation of weather conditions, the temperature, the humidity the wind speed, and the UV index (the color should indicate whether the conditions are favorable, moderate, or severe) Add that city to the search history. Show the 5-day forecast that displays the date, an icon representation of weather conditions, the temperature, and the humidity. Clicking on a city in the search history present the current and future conditions for that city. Save search history to local storage and when loading the page present the last searched city forecast.",
      "href": "https://lohelani.github.io/weather-dashboard/"
    },
    {
      "id": 6,
      "name": "Note Taker",
      "image": "https://i.ibb.co/BK6TJwy/note-taker.png",
      "description": "Note taker: This application is to be used as a note taker app. To run the code from your local device, clone repository to your vscode. Dependencies are fs, util, uuid, express, and router. once dependencies are installed, run node server.js in your terminal and open via link in terminal on port 3000. Completion of this app was accomplished by using get, post, and delete methods. I used router and expresss primarily and used uuid to target the text elements. for my write and read files i used async.",
      "href": "https://thawing-shelf-78357.herokuapp.com/"
    }
  ]
  